app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)
    @category.user_id = @current_user.id
    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`created_at`, `name`, `order`, `updated_at`, `user_id`) VALUES ('2014-06-14 12:58:06', 'test', 0, '2014-06-14 12:58:06', 0)

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE `categories` SET `name` = 'testaaa', `updated_at` = '2014-06-14 13:03:20' WHERE `categories`.`id` = 3

  def destroy
    @category.destroy
---
DELETE FROM `categories` WHERE `categories`.`id` = 4

    def set_category
      @category = @current_user.categories.find_by(id:params[:id])
---
SELECT  `categories`.* FROM `categories`  WHERE `categories`.`id` = 6 AND `categories`.`user_id` = 6 LIMIT 1