app/controllers/tasks_controller.rb

INSERT INTO `tasks` (`created_at`, `end_time`, `goal`, `memo`, `name`, `priority`, `start_time`, `state`, `updated_at`, `user_id`) VALUES ('2014-07-13 09:52:49', '2014-07-13 09:52:00', 'タスクタスク', 'あああ\r\nああああああ\r\nああ', 'タスク', 2, '2014-07-13 09:52:00', 1, '2014-07-13 09:52:49', 26)
---
  def create
    @task = Task.new(task_params)
    @task.user_id = @current_user.id
    respond_to do |format|
      if @task.save

UPDATE `tasks` SET `goal` = 'Goalタスクマネージャー', `updated_at` = '2014-07-19 13:09:21' WHERE `tasks`.`id` = 5
---
  def update
    respond_to do |format|
      if @task.update(task_params)

SELECT `tasks`.* FROM `tasks`  WHERE `tasks`.`user_id` = 28  ORDER BY tasks.priority asc, tasks.start_time asc
---
    def set_task
      @task = @current_user.tasks.find_by(id:params[:id])