app/controllers/taskmails_controller.rb

  def create
    @taskmail = Taskmail.new(taskmail_params)
    respond_to do |format|
      Appsetup.sendmail(@taskmail)
      if @taskmail.save
---
INSERT INTO `taskmails` (`address`, `bcc`, `cc`, `created_at`, `footer`, `from`, `header`, `subject`, `text`, `updated_at`) VALUES ('exp.sei16@gmail.com', 'exp.sei16@gmail.com', 'exp.sei16@gmail.com', '2014-07-23 21:50:28', '以上、報告させて頂きます。', 'sohara_contact9022@jcom.home.ne.jp', 'お疲れ様です。テストです。\r\n本日の日報をお送り致します。\r\n\r\n', '【日報_724】', '1　：　タスクマネージャー　Goalタスクマネージャー\r\n', '2014-07-23 21:50:28')

    def set_taskmail
      @taskmail = Taskmail.find(params[:id])
---
SELECT  `taskmails`.* FROM `taskmails`  WHERE `taskmails`.`id` = 1 LIMIT 1