app/controllers/users_controller.rb

UPDATE `users` SET `mail` = 'sohara@jp.jpaho', `nickname` = 'sohara1', `updated_at` = '2014-06-21 04:23:58' WHERE `users`.`id` = 22
---
  def update
    if !isedit
      redirect_to root_path
    end
    edit_user_params
    if User.updateuser(@user)